Ran Plan for dir: `poc/dev/fulfillment` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_global_forwarding_rule.https will be created
  + resource "google_compute_global_forwarding_rule" "https" {
      + id                    = (known after apply)
      + ip_address            = "35.244.234.167"
      + ip_protocol           = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "fulfillment-controller-https"
      + port_range            = "443"
      + project               = (known after apply)
      + self_link             = (known after apply)
      + target                = (known after apply)
    }

  # google_compute_target_https_proxy.default will be created
  + resource "google_compute_target_https_proxy" "default" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "fulfillment-controller-https-proxy"
      + project            = (known after apply)
      + proxy_id           = (known after apply)
      + quic_override      = "NONE"
      + self_link          = (known after apply)
      + ssl_certificates   = [
          + "projects/ccai-df-mva-lab1/global/sslCertificates/fulfillment-controller-cert",
        ]
      + url_map            = (known after apply)
    }

  # google_compute_url_map.default will be created
  + resource "google_compute_url_map" "default" {
      + creation_timestamp = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "fulfillment-controller-url-map"
      + project            = (known after apply)
      + self_link          = (known after apply)

      + default_url_redirect {
          + https_redirect = false
          + path_redirect  = "/"
          + strip_query    = true
        }

      + host_rule {
          + hosts        = [
              + "*",
            ]
          + path_matcher = "default"
        }

      + path_matcher {
          + name = "default"

          + default_url_redirect {
              + https_redirect = false
              + path_redirect  = "/"
              + strip_query    = true
            }

          + route_rules {
              + priority = 1
              + service  = "projects/ccai-df-mva-lab1/global/backendServices/fulfillment-controller-backend"

              + match_rules {
                  + ignore_case  = false
                  + prefix_match = "/webhook"

                  + header_matches {
                      + exact_match  = "password"
                      + header_name  = "df_auth"
                      + invert_match = false
                    }
                }
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d poc/dev/fulfillment`
* :put_litter_in_its_place: To **delete** this plan click [here](http://35.193.191.10:4141/lock?id=tandonc%252Fterraform-google-ccai%252Fpoc%252Fdev%252Ffulfillment%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d poc/dev/fulfillment`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
